app/views/events/show.html.erb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 AND "attendances"."event_id" = $2 LIMIT $3  [["user_id", 0], ["event_id", 0], ["LIMIT", 1]]
---

	<% if Attendance.find_by(user_id: 'current_user.id', event_id: '@event.id')%>