app/controllers/attendances_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
		def new
			@event = Event.find(params[:format])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_F2Fqim1NOah7hW"], ["user_id", 60], ["event_id", 61], ["created_at", "2019-05-09 12:26:45.668088"], ["updated_at", "2019-05-09 12:26:45.668088"]]
---
		def create

			event = Event.find(params[:id])

			 # Amount in cents
			@amount = 500

			customer = Stripe::Customer.create({
				email: params[:stripeEmail],
				source: params[:stripeToken],
			})


			  charge = Stripe::Charge.create({
			      customer: customer.id,
			      amount: @amount,
			      description: 'Rails Stripe customer',
			      currency: 'eur',
					})

 			@attendance = Attendance.create(stripe_customer_id: customer.id, event_id: event.id, user_id: current_user.id)