app/controllers/event_controller.rb

  def index
  	@event = Event.all
---
SELECT "events".* FROM "events"