app/controllers/events_controller.rb

  def index
  	@event = Event.all
---
SELECT "events".* FROM "events"

  def create

  	@event = Event.create(start_date: params[:start_date], duration: params[:duration], title: params[:title], description: params[:description], price: params[:price], location: params[:location], admin_id: current_user.id )
---
INSERT INTO "events" ("duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"